НВ_Доработки/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/CommonForms/ФормаЗагрузкиИзПостроителя/Ext/Form/Module.bsl
&НаКлиенте
&ИзменениеИКонтроль("ОбработатьФайлНаКлиенте")
Функция НВД_ОбработатьФайлНаКлиенте(ПолноеИмяФайлаЗагрузки)	
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайлаЗагрузки);
	МассивПродукции = Новый Массив;
	// загружаем файл
	ВыбранноеИмяФайла = СтруктураИмениФайла.ПолноеИмя;
	ДобавитьВЖурналЗагрузки("Начало обработки файла " + СтруктураИмениФайла.Имя);
	
	МассивСообщенийКВыводу = Новый Массив;
	СтруктураФайла = ОбменСПостроителемКлиентСервер.ПрочитатьФайлПостроителя(ПолноеИмяФайлаЗагрузки, МассивСообщенийКВыводу);		
	Если СтруктураФайла = Неопределено Тогда
		Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
		КонецЦикла;
		Возврат МассивПродукции;
	КонецЕсли;
		
	УдаленОсновнойФайл = Ложь;
	
	СписокПутейКФайламКУдалению = Новый СписокЗначений;
	СписокДвоичныхДанныхФайлов = Новый СписокЗначений;
	
	МассивСообщенийКВыводу.Очистить();
	ОбменСПостроителемКлиентСервер.СформироватьСписокПутейКФайлам(СтруктураФайла, СписокПутейКФайламКУдалению, СписокДвоичныхДанныхФайлов, МассивСообщенийКВыводу);	
	Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
		ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
	КонецЦикла;
		
	РезервироватьФайлы = Ложь;
	
	Если НЕ ЭтоРозница Тогда
		// загрузка в заказ покупателя
		Если НЕ ПоВладельцу Тогда
			РезультатЗагрузки = ОбменСEasyCeiling.ЗагрузитьРасчетEasyCeilingИзФайла(СтруктураФайла, СписокДвоичныхДанныхФайлов);
			МассивПродукции = РезультатЗагрузки.МассивПродукции;
		Иначе
			ВладелецФормыОбъект = ЭтаФорма.ВладелецФормы.Объект; 
			РезультатЗагрузки = ЗагрузитьРасчетEasyCeilingИзФайлаВФорму(СтруктураФайла, СписокДвоичныхДанныхФайлов, ВладелецФормыОбъект);
			#Вставка 
			//nva+++
			//Отключил Иван 04.12.2025
			//ИсключитьМатериалыИПотолкиКоторыхНетВНаличии(РезультатЗагрузки);
			//nva--
			//Ярославцев А.А 08.11.2022
			ПараметрыОкругленияПриЗагрузке(РезультатЗагрузки);
			//Ярославцев А.А 08.11.2022
			Для Каждого Материал Из ЭтаФорма.ВладелецФормы.Объект.Материалы Цикл
				
			КонецЦикла;	
			#КонецВставки
			КопироватьДанныеФормы(РезультатЗагрузки.ДанныеФормы, ЭтаФорма.ВладелецФормы.Объект); 
		КонецЕсли;
		
		Для каждого ЭлементМассива из РезультатЗагрузки.МассивСообщений Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстСообщения, ЭлементМассива.ЭтоОшибка);	
		КонецЦикла;
		
		Если РезультатЗагрузки.ЕстьКритичныеОшибки Тогда			
			ПропущеноФайлов = ПропущеноФайлов + 1;
		Иначе
			РезервироватьФайлы = Истина;
			Если НЕ РезультатЗагрузки.ЗаказОбновлен Тогда
				КоличествоНовыхЗаказов = КоличествоНовыхЗаказов + 1;
			Иначе
				КоличествоОбновленныхЗаказов = КоличествоОбновленныхЗаказов + 1;
			КонецЕсли;
		КонецЕсли;
	Иначе
		// загрузка в заказ-договор / монтаж / предварительный расчет
		ПродолжитьЗагрузку = Истина;
		ОписаниеОшибки = "";
		СтруктураПотолок = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтруктураФайла, СписокДвоичныхДанныхФайлов, , Ложь,,,, ОписаниеОшибки,, Истина);
		Если СтруктураПотолок = Неопределено Тогда
			ДобавитьВЖурналЗагрузки("Ошибка загрузки потолка!", Истина);
			ПродолжитьЗагрузку = Ложь;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ДобавитьВЖурналЗагрузки(ОписаниеОшибки, Истина);
			ПродолжитьЗагрузку = Ложь;
		КонецЕсли;
		
		Если ПродолжитьЗагрузку Тогда
			
			ВладелецФормыОбъект = ЭтаФорма.ВладелецФормы.Объект; 
			СтруктураЗагрузкиРасчета = ЗагрузитьРасчетВФормуДокументаРозницы(СтруктураФайла, СписокДвоичныхДанныхФайлов, ВладелецФормыОбъект);
			КопироватьДанныеФормы(СтруктураЗагрузкиРасчета.ДанныеФормы, ЭтаФорма.ВладелецФормы.Объект); 
			
			Если СтруктураЗагрузкиРасчета.РезультатЗагрузки = Неопределено Тогда
				ТекстОшибки = "Ошибка загрузки потолка";				
				Если ЗначениеЗаполнено(СтруктураЗагрузкиРасчета.ОписаниеОшибки) Тогда
					ТекстОшибки = ТекстОшибки +": " + СтруктураЗагрузкиРасчета.ОписаниеОшибки;
				Иначе
					ТекстОшибки = ТекстОшибки +"!";
				КонецЕсли;
				ДобавитьВЖурналЗагрузки(ТекстОшибки, Истина);
				ПропущеноФайлов = ПропущеноФайлов + 1;  // #12872
			Иначе
				РезервироватьФайлы = Истина;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
	
	Если РезервироватьФайлы Тогда // успешная загрузка
		МассивСообщенийКВыводу.Очистить();
		ОбменСПостроителемКлиентСервер.ПеренестиФайлыПостроителяВАрхив(КаталогРезервныхКопий, ПолноеИмяФайлаЗагрузки, СписокПутейКФайламКУдалению, МассивСообщенийКВыводу);
		Для каждого ЭлементМассива из МассивСообщенийКВыводу Цикл
			ДобавитьВЖурналЗагрузки(ЭлементМассива.ТекстОшибки, ЭлементМассива.ЭтоОшибка);
		КонецЦикла;		
	КонецЕсли;
	
	ДобавитьВЖурналЗагрузки("Завершена обработка файла " + СтруктураИмениФайла.ПолноеИмя);
	
	Возврат МассивПродукции;
	
КонецФункции

&НаСервере
Процедура ПараметрыОкругленияПриЗагрузке(РезультатЗагрузки)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТоваров", РезультатЗагрузки.ДанныеФормы.Товары.Выгрузить(,"Номенклатура,ЕдиницаИзмерения"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	доп_ПараметрыОкругленияЕдиницИзмерения.Номенклатура КАК Номенклатура,
	|	доп_ПараметрыОкругленияЕдиницИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	доп_ПараметрыОкругленияЕдиницИзмерения.ПорогСрабатывания КАК ПорогСрабатывания,
	|	доп_ПараметрыОкругленияЕдиницИзмерения.ЗначениеУстановки КАК ЗначениеУстановки,
	|	доп_ПараметрыОкругленияЕдиницИзмерения.МинимальнаяЦена КАК МинимальнаяЦена
	|ПОМЕСТИТЬ ВТ_Параметры
	|ИЗ
	|	РегистрСведений.доп_ПараметрыОкругленияЕдиницИзмерения КАК доп_ПараметрыОкругленияЕдиницИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_Параметры.ПорогСрабатывания, 0) КАК ПорогСрабатывания,
	|	ЕСТЬNULL(ВТ_Параметры.ЗначениеУстановки, 0) КАК ЗначениеУстановки,
	|	ЕСТЬNULL(ВТ_Товары.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ВТ_Параметры.МинимальнаяЦена, 0) КАК МинЦена
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Параметры КАК ВТ_Параметры
	|		ПО ВТ_Товары.ЕдиницаИзмерения = ВТ_Параметры.ЕдиницаИзмерения
	|ГДЕ
	|	ВТ_Товары.Номенклатура В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТ_Параметры.Номенклатура
	|			ИЗ
	|				ВТ_Параметры)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
		Отбор.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		НайденныеСтроки = РезультатЗагрузки.ДанныеФормы.Товары.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 0 Тогда 
			Для каждого НСтрока из НайденныеСтроки Цикл
				
				Если Выборка.ПорогСрабатывания > НСтрока.Количество Тогда 
					НСтрока.Количество = Выборка.ЗначениеУстановки;
					НСтрока.Цена = Выборка.МинЦена;
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НСтрока,Ложь,"СуммаРучнойСкидки");
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НСтрока,Истина);
				КонецЕсли;
				
				Если Выборка.МинЦена > НСтрока.Цена Тогда 
					НСтрока.Цена = Выборка.МинЦена;
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НСтрока,Ложь,"СуммаРучнойСкидки");
					ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НСтрока,Истина);
				КонецЕсли;
				
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ИсключитьМатериалыИПотолкиКоторыхНетВНаличии(РезультатЗагрузки)
	
	ЗаполнитьДанныеОстаткиПоМатериаламВРезультатЗагрузки(РезультатЗагрузки);
	
	МассивПотолковКУдалению = Новый Массив; 
	
	Для Каждого Материал Из РезультатЗагрузки.ДанныеФормы.Материалы Цикл
		Если НЕ ЗначениеЗаполнено(Материал.Потолок) Тогда
			//проверяем только потолки
			Продолжить;               
		КонецЕсли;
		
		ОтборПоПотолку = Новый Структура("Номенклатура", Материал.Потолок); 	
		НайденныеСтрокиПотолки = РезультатЗагрузки.ДанныеФормы.Товары.НайтиСтроки(ОтборПоПотолку);
		Если НайденныеСтрокиПотолки.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(НайденныеСтрокиПотолки[0].ЗаказНаПроизводство) ИЛИ НайденныеСтрокиПотолки[0].ОстатокНаСкладе >= НайденныеСтрокиПотолки[0].Количество Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		Если Материал.Доступно < Материал.Количество Тогда
			Если МассивПотолковКУдалению.Найти(Материал.Потолок) = Неопределено Тогда
				ТекстОшибки = "Потолок: " + Материал.Потолок + " загружен не будет, так как по нему не хватает материала: " + Материал.Номенклатура + "!";
				РезультатЗагрузки.МассивСообщений.Добавить(Новый Структура("ТекстСообщения, ЭтоОшибка", ТекстОшибки, Истина));
				МассивПотолковКУдалению.Добавить(Материал.Потолок);                      
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из МассивПотолковКУдалению Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Потолок", ЭлементМассива);
		НайденныеСтроки = РезультатЗагрузки.ДанныеФормы.Материалы.НайтиСтроки(Отбор);	
		Если НайденныеСтроки.Количество() > 0 Тогда 
			Для каждого НСтрока из НайденныеСтроки Цикл
				РезультатЗагрузки.ДанныеФормы.Материалы.Удалить(НСтрока);	
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
		
	Для Каждого ЭлементМассива Из МассивПотолковКУдалению Цикл 	
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЭлементМассива);
		НайденныеСтроки = РезультатЗагрузки.ДанныеФормы.Товары.НайтиСтроки(Отбор);	
		Если НайденныеСтроки.Количество() > 0 Тогда 
			Для каждого НСтрока из НайденныеСтроки Цикл
				РезультатЗагрузки.ДанныеФормы.Товары.Удалить(НСтрока);	
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеОстаткиПоМатериаламВРезультатЗагрузки(РезультатЗагрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
	|	ТЗЗаказПокупателяМатериалы.ХарактеристикаНоменклатуры,
	|	ТЗЗаказПокупателяМатериалы.СерияНоменклатуры,
	|	ТЗЗаказПокупателяМатериалы.Количество КАК Количество,
	|	ТЗЗаказПокупателяМатериалы.Коэффициент КАК Коэффициент,
	|	ТЗЗаказПокупателяМатериалы.Потолок КАК Потолок
	|ПОМЕСТИТЬ ВремЗаказПокупателяТовары
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗЗаказПокупателяМатериалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяМатериалы.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяМатериалы.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяМатериалы.Коэффициент <> 0
	|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ЗаказПокупателяМатериалы.Коэффициент
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	ЕСТЬNULL(ВЫБОР		
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяМатериалы.Коэффициент <> 0
	|						ТОГДА ВРезервеОстатки.КоличествоОстаток / ЗаказПокупателяМатериалы.Коэффициент
	|					ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ, 0) КАК КоличествоВРезерве
	//|	ЗаказПокупателяМатериалы.Потолок КАК Потолок,
	//|	ВЫБОР
	//|		КОГДА ОстаткиОбороты.Регистратор ССЫЛКА Документ.ВыпускПродукции
	//|			ТОГДА ЕСТЬNULL(ОстаткиОбороты.КоличествоПриход, 0)
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК ВыпускПотолка
	|ИЗ
	|	ВремЗаказПокупателяТовары КАК ЗаказПокупателяМатериалы
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ЗаказПокупателяМатериалы.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ОстаткиОбороты
	//|		ПО ЗаказПокупателяМатериалы.Потолок = ОстаткиОбороты.Номенклатура
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО (ЗаказПокупателяМатериалы.Номенклатура = ВРезервеОстатки.Номенклатура)
	|			И (ЗаказПокупателяМатериалы.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)
	|			И (ЗаказПокупателяМатериалы.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры)
	|";
	Запрос.УстановитьПараметр("ТаблицаДокумента", РезультатЗагрузки.ДанныеФормы.Материалы.Выгрузить());
	Запрос.УстановитьПараметр("Организация", РезультатЗагрузки.ДанныеФормы.Организация);
	Запрос.УстановитьПараметр("Склад", РезультатЗагрузки.ДанныеФормы.СкладМатериалов);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("ИспользоватьРезервирование", ПолучитьФункциональнуюОпцию("ИспользоватьРезервирование"));
	Запрос.УстановитьПараметр("ТекущийЗаказ", РезультатЗагрузки.ДанныеФормы.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из РезультатЗагрузки.ДанныеФормы.Материалы Цикл 			
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
		Отбор.Вставить("СерияНоменклатуры", ТекущаяСтрока.СерияНоменклатуры);
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока.ОстатокНаСкладе = НайденныеСтроки[0].ОстатокНаСкладе;		
			ТекущаяСтрока.ВРезерве 		  = НайденныеСтроки[0].КоличествоВРезерве;
			ТекущаяСтрока.Доступно 		  = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;
			//Если НЕ ТекущаяСтрока.Потолок = Неопределено И НЕ ТекущаяСтрока.Потолок.Пустая() и ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Потолок) Тогда				
			//	//если это номенклатура, привязанная к выпуску потолка, заполняем наличие выпуска потолка
			//	Если НайденныеСтроки[0].ВыпускПотолка > 0 Тогда
			//		ТекущаяСтрока.ЕстьДокументВыпускаПоПотолку = Истина;
			//	Иначе
			//		ТекущаяСтрока.ЕстьДокументВыпускаПоПотолку = Ложь;
			//	КонецЕсли;
			//ИначеЕсли НЕ ТекущаяСтрока.Потолок = Неопределено И НЕ ТекущаяСтрока.Потолок.Пустая() и НЕ ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Потолок) Тогда
			//	//если это номенклатура, привязанная к выпуску типового товара (материала или типового отреза), считаемб что выпуск есть, если есть заказ на производство в статусе Произведен
			//	Отбор = Новый Структура;
			//	Отбор.Вставить("УИСтроки",ТекущаяСтрока.УИСтроки);
			//	НайденныеСтроки = Объект.Товары.НайтиСтроки(Отбор);
			//	Если НайденныеСтроки.Количество() > 0 Тогда
			//		ЗаказНаПроизводство = НайденныеСтроки[0].ЗаказНаПроизводство;
			//		Если НЕ ЗаказНаПроизводство = Неопределено И НЕ ЗаказНаПроизводство.Пустая() Тогда
			//			Если ЗаказНаПроизводство.ТекущийСтатус = Справочники.СтатусыЗаказовНаПроизводство.Произведен Тогда
			//				ТекущаяСтрока.ЕстьДокументВыпускаПоПотолку = Истина;
			//			Иначе
			//				ТекущаяСтрока.ЕстьДокументВыпускаПоПотолку = Ложь;
			//			КонецЕсли;
			//		Иначе
			//			ТекущаяСтрока.ЕстьДокументВыпускаПоПотолку = Ложь;
			//		КонецЕсли;
			//	КонецЕсли;
			//	
			//КонецЕсли;			
		Иначе
			ТекущаяСтрока.ОстатокНаСкладе = 0;
			ТекущаяСтрока.ВРезерве 		  = 0;
			ТекущаяСтрока.Доступно 		  = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
